app/controllers/inquiries_controller.rb

SELECT * FROM `inquiries`
---
  def index
    @inquiries = Inquiry.all

INSERT INTO `inquiries` (`name`, `created_at`, `recipient_email`, `updated_at`, `phone`, `message`, `recipient_name`, `email`) VALUES('d', '2010-01-28 04:35:19', NULL, '2010-01-28 04:35:19', '', 'x', NULL, '')
---
  def create
    @inquiry = Inquiry.new(params[:inquiry])
    if @inquiry.save