app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`permalink` = 'home') LIMIT 1
SELECT * FROM `pages` WHERE (`pages`.`id` = 0)
---
  def show
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
    else
      @page = Page.find(params[:id])